Zalmotek/renesas-RA8M1-feather/RA8M1-Tutorials/1-inputs/RA8M1_Feather_Inputs_PMODScreenDemo/src/registers_i2c.h
/*
 *****************************************************************************
 * Copyright by ams OSRAM AG                                                       *
 * All rights are reserved.                                                  *
 *                                                                           *
 * IMPORTANT - PLEASE READ CAREFULLY BEFORE COPYING, INSTALLING OR USING     *
 * THE SOFTWARE.                                                             *
 *                                                                           *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS       *
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT         *
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS         *
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  *
 * OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,     *
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT          *
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,     *
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY     *
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT       *
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE     *
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.      *
 *****************************************************************************
 */

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// !!         THIS FILE IS AUTOMATICALLY GENERATED         !!
// !!              DO NOT EDIT THIS FILE                   !!
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

#ifndef REGISTERS_I2C_H
#define REGISTERS_I2C_H

#define ENABLE_REG 0xe0
#define ENABLE__cpu_reset__MASK  0x80
#define ENABLE__cpu_reset__WIDTH 1
#define ENABLE__cpu_reset__SHIFT 7
#define ENABLE__cpu_reset__RESET 0
#define ENABLE__cpu_reset 128
#define ENABLE__cpu_ready__MASK  0x40
#define ENABLE__cpu_ready__WIDTH 1
#define ENABLE__cpu_ready__SHIFT 6
#define ENABLE__cpu_ready__RESET 0
#define ENABLE__cpu_ready 64
#define ENABLE__powerup_select__MASK  0x30
#define ENABLE__powerup_select__WIDTH 2
#define ENABLE__powerup_select__SHIFT 4
#define ENABLE__powerup_select__RESET 0
// Enumeration for powerup_select
#define ENABLE__powerup_select__no_override 0 // Do what is selected in the boot_select fuses
#define ENABLE__powerup_select__start_boot_monitor 1 // Always start the boot monitor, do not go to sleep
#define ENABLE__powerup_select__start_app_in_ram 2 // Start the application that is in RAM
#define ENABLE__powerup_select__reserved 3 // Reserved for future use

#define ENABLE__pinmux_unlock__MASK  0x8
#define ENABLE__pinmux_unlock__WIDTH 1
#define ENABLE__pinmux_unlock__SHIFT 3
#define ENABLE__pinmux_unlock__RESET 0
#define ENABLE__pinmux_unlock 8
#define ENABLE__timed_standby_mode__MASK  0x4
#define ENABLE__timed_standby_mode__WIDTH 1
#define ENABLE__timed_standby_mode__SHIFT 2
#define ENABLE__timed_standby_mode__RESET 0
#define ENABLE__timed_standby_mode 4
#define ENABLE__standby_mode__MASK  0x2
#define ENABLE__standby_mode__WIDTH 1
#define ENABLE__standby_mode__SHIFT 1
#define ENABLE__standby_mode__RESET 0
#define ENABLE__standby_mode 2
#define ENABLE__pon__MASK  0x1
#define ENABLE__pon__WIDTH 1
#define ENABLE__pon__SHIFT 0
#define ENABLE__pon__RESET 1
#define ENABLE__pon 1

#define INT_STATUS 0xe1
#define INT_STATUS__int8__MASK  0x80
#define INT_STATUS__int8__WIDTH 1
#define INT_STATUS__int8__SHIFT 7
#define INT_STATUS__int8__RESET 0
#define INT_STATUS__int8 128
#define INT_STATUS__int7__MASK  0x40
#define INT_STATUS__int7__WIDTH 1
#define INT_STATUS__int7__SHIFT 6
#define INT_STATUS__int7__RESET 0
#define INT_STATUS__int7 64
#define INT_STATUS__int6__MASK  0x20
#define INT_STATUS__int6__WIDTH 1
#define INT_STATUS__int6__SHIFT 5
#define INT_STATUS__int6__RESET 0
#define INT_STATUS__int6 32
#define INT_STATUS__int5__MASK  0x10
#define INT_STATUS__int5__WIDTH 1
#define INT_STATUS__int5__SHIFT 4
#define INT_STATUS__int5__RESET 0
#define INT_STATUS__int5 16
#define INT_STATUS__int4__MASK  0x8
#define INT_STATUS__int4__WIDTH 1
#define INT_STATUS__int4__SHIFT 3
#define INT_STATUS__int4__RESET 0
#define INT_STATUS__int4 8
#define INT_STATUS__int3__MASK  0x4
#define INT_STATUS__int3__WIDTH 1
#define INT_STATUS__int3__SHIFT 2
#define INT_STATUS__int3__RESET 0
#define INT_STATUS__int3 4
#define INT_STATUS__int2__MASK  0x2
#define INT_STATUS__int2__WIDTH 1
#define INT_STATUS__int2__SHIFT 1
#define INT_STATUS__int2__RESET 0
#define INT_STATUS__int2 2
#define INT_STATUS__int1__MASK  0x1
#define INT_STATUS__int1__WIDTH 1
#define INT_STATUS__int1__SHIFT 0
#define INT_STATUS__int1__RESET 0
#define INT_STATUS__int1 1

#define INT_ENAB 0xe2
#define INT_ENAB__int8_enab__MASK  0x80
#define INT_ENAB__int8_enab__WIDTH 1
#define INT_ENAB__int8_enab__SHIFT 7
#define INT_ENAB__int8_enab__RESET 0
#define INT_ENAB__int8_enab 128
#define INT_ENAB__int7_enab__MASK  0x40
#define INT_ENAB__int7_enab__WIDTH 1
#define INT_ENAB__int7_enab__SHIFT 6
#define INT_ENAB__int7_enab__RESET 0
#define INT_ENAB__int7_enab 64
#define INT_ENAB__int6_enab__MASK  0x20
#define INT_ENAB__int6_enab__WIDTH 1
#define INT_ENAB__int6_enab__SHIFT 5
#define INT_ENAB__int6_enab__RESET 0
#define INT_ENAB__int6_enab 32
#define INT_ENAB__int5_enab__MASK  0x10
#define INT_ENAB__int5_enab__WIDTH 1
#define INT_ENAB__int5_enab__SHIFT 4
#define INT_ENAB__int5_enab__RESET 0
#define INT_ENAB__int5_enab 16
#define INT_ENAB__int4_enab__MASK  0x8
#define INT_ENAB__int4_enab__WIDTH 1
#define INT_ENAB__int4_enab__SHIFT 3
#define INT_ENAB__int4_enab__RESET 0
#define INT_ENAB__int4_enab 8
#define INT_ENAB__int3_enab__MASK  0x4
#define INT_ENAB__int3_enab__WIDTH 1
#define INT_ENAB__int3_enab__SHIFT 2
#define INT_ENAB__int3_enab__RESET 0
#define INT_ENAB__int3_enab 4
#define INT_ENAB__int2_enab__MASK  0x2
#define INT_ENAB__int2_enab__WIDTH 1
#define INT_ENAB__int2_enab__SHIFT 1
#define INT_ENAB__int2_enab__RESET 0
#define INT_ENAB__int2_enab 2
#define INT_ENAB__int1_enab__MASK  0x1
#define INT_ENAB__int1_enab__WIDTH 1
#define INT_ENAB__int1_enab__SHIFT 0
#define INT_ENAB__int1_enab__RESET 0
#define INT_ENAB__int1_enab 1

#define ID_REG 0xe3
#define ID__id__MASK  0x3f
#define ID__id__WIDTH 6
#define ID__id__SHIFT 0
#define ID__id__RESET 08

