Zalmotek/renesas-RA8M1-feather/RA8M1-Tutorials/1-inputs/RA8M1_Feather_Inputs_PMODScreenDemo/src/registers_i2c.h
#define REVID 0xe4
#define REVID__rev_id__MASK  0x7
#define REVID__rev_id__WIDTH 3
#define REVID__rev_id__SHIFT 0
#define REVID__rev_id__RESET 0

#define CTRL0 0xe5
#define CTRL0__foundry_page__MASK  0x80
#define CTRL0__foundry_page__WIDTH 1
#define CTRL0__foundry_page__SHIFT 7
#define CTRL0__foundry_page__RESET 0
#define CTRL0__foundry_page 128
#define CTRL0__p2ram_fusenr__MASK  0x60
#define CTRL0__p2ram_fusenr__WIDTH 2
#define CTRL0__p2ram_fusenr__SHIFT 5
#define CTRL0__p2ram_fusenr__RESET 0
#define CTRL0__spare_e5_2__MASK  0x10
#define CTRL0__spare_e5_2__WIDTH 1
#define CTRL0__spare_e5_2__SHIFT 4
#define CTRL0__spare_e5_2__RESET 0
#define CTRL0__spare_e5_2 16
#define CTRL0__skip_initwait__MASK  0x8
#define CTRL0__skip_initwait__WIDTH 1
#define CTRL0__skip_initwait__SHIFT 3
#define CTRL0__skip_initwait__RESET 0
#define CTRL0__skip_initwait 8
#define CTRL0__cp_enable__MASK  0x4
#define CTRL0__cp_enable__WIDTH 1
#define CTRL0__cp_enable__SHIFT 2
#define CTRL0__cp_enable__RESET 0
#define CTRL0__cp_enable 4
#define CTRL0__spare_e5__MASK  0x3
#define CTRL0__spare_e5__WIDTH 2
#define CTRL0__spare_e5__SHIFT 0
#define CTRL0__spare_e5__RESET 0

#define VCSEL_CFG 0xe6
#define VCSEL_CFG__sel_vcdrv_pls_source__MASK  0x80
#define VCSEL_CFG__sel_vcdrv_pls_source__WIDTH 1
#define VCSEL_CFG__sel_vcdrv_pls_source__SHIFT 7
#define VCSEL_CFG__sel_vcdrv_pls_source__RESET 0
#define VCSEL_CFG__sel_vcdrv_pls_source 128
#define VCSEL_CFG__vcsel_incr_glow_curr__MASK  0x40
#define VCSEL_CFG__vcsel_incr_glow_curr__WIDTH 1
#define VCSEL_CFG__vcsel_incr_glow_curr__SHIFT 6
#define VCSEL_CFG__vcsel_incr_glow_curr__RESET 0
#define VCSEL_CFG__vcsel_incr_glow_curr 64
#define VCSEL_CFG__en_vcdrv_shunt_s__MASK  0x20
#define VCSEL_CFG__en_vcdrv_shunt_s__WIDTH 1
#define VCSEL_CFG__en_vcdrv_shunt_s__SHIFT 5
#define VCSEL_CFG__en_vcdrv_shunt_s__RESET 0
#define VCSEL_CFG__en_vcdrv_shunt_s 32
#define VCSEL_CFG__en_vcdrv_shunt_w__MASK  0x10
#define VCSEL_CFG__en_vcdrv_shunt_w__WIDTH 1
#define VCSEL_CFG__en_vcdrv_shunt_w__SHIFT 4
#define VCSEL_CFG__en_vcdrv_shunt_w__RESET 0
#define VCSEL_CFG__en_vcdrv_shunt_w 16
#define VCSEL_CFG__spare_e6__MASK  0xc
#define VCSEL_CFG__spare_e6__WIDTH 2
#define VCSEL_CFG__spare_e6__SHIFT 2
#define VCSEL_CFG__spare_e6__RESET 0
#define VCSEL_CFG__vcsel_poweron__MASK  0x2
#define VCSEL_CFG__vcsel_poweron__WIDTH 1
#define VCSEL_CFG__vcsel_poweron__SHIFT 1
#define VCSEL_CFG__vcsel_poweron__RESET 0
#define VCSEL_CFG__vcsel_poweron 2
#define VCSEL_CFG__vcsel_enable__MASK  0x1
#define VCSEL_CFG__vcsel_enable__WIDTH 1
#define VCSEL_CFG__vcsel_enable__SHIFT 0
#define VCSEL_CFG__vcsel_enable__RESET 0
#define VCSEL_CFG__vcsel_enable 1

#define VCSEL_CFG2 0xe7
#define VCSEL_CFG2__vcsel_pulsewidth__MASK  0xc0
#define VCSEL_CFG2__vcsel_pulsewidth__WIDTH 2
#define VCSEL_CFG2__vcsel_pulsewidth__SHIFT 6
#define VCSEL_CFG2__vcsel_pulsewidth__RESET 0
#define VCSEL_CFG2__vcsel_ipulse__MASK  0x3f
#define VCSEL_CFG2__vcsel_ipulse__WIDTH 6
#define VCSEL_CFG2__vcsel_ipulse__SHIFT 0
#define VCSEL_CFG2__vcsel_ipulse__RESET 0

#define VCSEL_CFG3 0xe8
#define VCSEL_CFG3__ss_amplitude__MASK  0xf8
#define VCSEL_CFG3__ss_amplitude__WIDTH 5
#define VCSEL_CFG3__ss_amplitude__SHIFT 3
#define VCSEL_CFG3__ss_amplitude__RESET 0
#define VCSEL_CFG3__spare_e8_2__MASK  0x4
#define VCSEL_CFG3__spare_e8_2__WIDTH 1
#define VCSEL_CFG3__spare_e8_2__SHIFT 2
#define VCSEL_CFG3__spare_e8_2__RESET 0
#define VCSEL_CFG3__spare_e8_2 4
#define VCSEL_CFG3__vcsel_ss_rounds__MASK  0x3
#define VCSEL_CFG3__vcsel_ss_rounds__WIDTH 2
#define VCSEL_CFG3__vcsel_ss_rounds__SHIFT 0
#define VCSEL_CFG3__vcsel_ss_rounds__RESET 0
// Enumeration for vcsel_ss_rounds
#define VCSEL_CFG3__vcsel_ss_rounds__single 0 // change modulation delay after each vcsel pulse round
#define VCSEL_CFG3__vcsel_ss_rounds__double 1 // after two pulse rounds
#define VCSEL_CFG3__vcsel_ss_rounds__triple 2 // after three pulse rounds
#define VCSEL_CFG3__vcsel_ss_rounds__quadruple 3 // after four pulse rounds


#define CP_CFG 0xe9
#define CP_CFG__cp_unregulated__MASK  0x80
#define CP_CFG__cp_unregulated__WIDTH 1
#define CP_CFG__cp_unregulated__SHIFT 7
#define CP_CFG__cp_unregulated__RESET 0
#define CP_CFG__cp_unregulated 128
#define CP_CFG__cp_vdd_hvchp__MASK  0x7f
#define CP_CFG__cp_vdd_hvchp__WIDTH 7
#define CP_CFG__cp_vdd_hvchp__SHIFT 0
#define CP_CFG__cp_vdd_hvchp__RESET 0

#define LDO_CTRL 0xea
#define LDO_CTRL__override_ldo_dig_en__MASK  0x80
#define LDO_CTRL__override_ldo_dig_en__WIDTH 1
#define LDO_CTRL__override_ldo_dig_en__SHIFT 7
#define LDO_CTRL__override_ldo_dig_en__RESET 0
#define LDO_CTRL__override_ldo_dig_en 128
#define LDO_CTRL__override_ldo_ana_en__MASK  0x40
#define LDO_CTRL__override_ldo_ana_en__WIDTH 1
#define LDO_CTRL__override_ldo_ana_en__SHIFT 6
#define LDO_CTRL__override_ldo_ana_en__RESET 0
#define LDO_CTRL__override_ldo_ana_en 64
#define LDO_CTRL__override_ldo_lp_hpmode__MASK  0x20
#define LDO_CTRL__override_ldo_lp_hpmode__WIDTH 1
#define LDO_CTRL__override_ldo_lp_hpmode__SHIFT 5
#define LDO_CTRL__override_ldo_lp_hpmode__RESET 0
#define LDO_CTRL__override_ldo_lp_hpmode 32
#define LDO_CTRL__ldo_tdcana_enable__MASK  0x10
#define LDO_CTRL__ldo_tdcana_enable__WIDTH 1
#define LDO_CTRL__ldo_tdcana_enable__SHIFT 4
#define LDO_CTRL__ldo_tdcana_enable__RESET 0
#define LDO_CTRL__ldo_tdcana_enable 16

#define VCSEL_STATUS 0xeb
#define VCSEL_STATUS__cp_overload__MASK  0x80
#define VCSEL_STATUS__cp_overload__WIDTH 1
#define VCSEL_STATUS__cp_overload__SHIFT 7
#define VCSEL_STATUS__cp_overload__RESET 0
#define VCSEL_STATUS__cp_overload 128
#define VCSEL_STATUS__vcdrv_overload__MASK  0x40
#define VCSEL_STATUS__vcdrv_overload__WIDTH 1
#define VCSEL_STATUS__vcdrv_overload__SHIFT 6
#define VCSEL_STATUS__vcdrv_overload__RESET 0
#define VCSEL_STATUS__vcdrv_overload 64
#define VCSEL_STATUS__vcsel_powered__MASK  0x10
#define VCSEL_STATUS__vcsel_powered__WIDTH 1
#define VCSEL_STATUS__vcsel_powered__SHIFT 4
#define VCSEL_STATUS__vcsel_powered__RESET 0
#define VCSEL_STATUS__vcsel_powered 16
#define VCSEL_STATUS__vcsel_ledk_fail__MASK  0x8
#define VCSEL_STATUS__vcsel_ledk_fail__WIDTH 1
#define VCSEL_STATUS__vcsel_ledk_fail__SHIFT 3
#define VCSEL_STATUS__vcsel_ledk_fail__RESET 0
#define VCSEL_STATUS__vcsel_ledk_fail 8
#define VCSEL_STATUS__vcsel_leda_fail__MASK  0x4
#define VCSEL_STATUS__vcsel_leda_fail__WIDTH 1
#define VCSEL_STATUS__vcsel_leda_fail__SHIFT 2
#define VCSEL_STATUS__vcsel_leda_fail__RESET 0
#define VCSEL_STATUS__vcsel_leda_fail 4
#define VCSEL_STATUS__vcsel_ledk_fail_detected__MASK  0x2
#define VCSEL_STATUS__vcsel_ledk_fail_detected__WIDTH 1
#define VCSEL_STATUS__vcsel_ledk_fail_detected__SHIFT 1
#define VCSEL_STATUS__vcsel_ledk_fail_detected__RESET 0
#define VCSEL_STATUS__vcsel_ledk_fail_detected 2
#define VCSEL_STATUS__vcsel_leda_fail_detected__MASK  0x1
#define VCSEL_STATUS__vcsel_leda_fail_detected__WIDTH 1
#define VCSEL_STATUS__vcsel_leda_fail_detected__SHIFT 0
#define VCSEL_STATUS__vcsel_leda_fail_detected__RESET 0
#define VCSEL_STATUS__vcsel_leda_fail_detected 1

#define CLOCK 0xec
#define CLOCK__pll_clk_select__MASK  0x40
#define CLOCK__pll_clk_select__WIDTH 1
#define CLOCK__pll_clk_select__SHIFT 6
#define CLOCK__pll_clk_select__RESET 0
#define CLOCK__pll_clk_select 64
#define CLOCK__pll_on__MASK  0x20
#define CLOCK__pll_on__WIDTH 1
#define CLOCK__pll_on__SHIFT 5
#define CLOCK__pll_on__RESET 0
#define CLOCK__pll_on 32
#define CLOCK__enab_pllclk__MASK  0x10
#define CLOCK__enab_pllclk__WIDTH 1
#define CLOCK__enab_pllclk__SHIFT 4
#define CLOCK__enab_pllclk__RESET 0
#define CLOCK__enab_pllclk 16
#define CLOCK__pll_lost_lock__MASK  0x8
#define CLOCK__pll_lost_lock__WIDTH 1
#define CLOCK__pll_lost_lock__SHIFT 3
#define CLOCK__pll_lost_lock__RESET 0
#define CLOCK__pll_lost_lock 8
#define CLOCK__enable_500khz_mode__MASK  0x4
#define CLOCK__enable_500khz_mode__WIDTH 1
#define CLOCK__enable_500khz_mode__SHIFT 2
#define CLOCK__enable_500khz_mode__RESET 0
#define CLOCK__enable_500khz_mode 4
#define CLOCK__clock_spare__MASK  0x3
#define CLOCK__clock_spare__WIDTH 2
#define CLOCK__clock_spare__SHIFT 0
#define CLOCK__clock_spare__RESET 0

