Zalmotek/renesas-RA8M1-feather/RA8M1-Tutorials/1-inputs/RA8M1_Feather_Inputs_PMODScreenDemo/src/registers_i2c.h
#define MISC0 0xed
#define MISC0__spare_ed__MASK  0x78
#define MISC0__spare_ed__WIDTH 4
#define MISC0__spare_ed__SHIFT 3
#define MISC0__spare_ed__RESET 0
#define MISC0__set_uvcomp_dig_ib5x__MASK  0x7
#define MISC0__set_uvcomp_dig_ib5x__WIDTH 3
#define MISC0__set_uvcomp_dig_ib5x__SHIFT 0
#define MISC0__set_uvcomp_dig_ib5x__RESET 0

#define VCSEL_CFG4 0xee
#define VCSEL_CFG4__override_vcsel_rstn__MASK  0x80
#define VCSEL_CFG4__override_vcsel_rstn__WIDTH 1
#define VCSEL_CFG4__override_vcsel_rstn__SHIFT 7
#define VCSEL_CFG4__override_vcsel_rstn__RESET 0
#define VCSEL_CFG4__override_vcsel_rstn 128
#define VCSEL_CFG4__vcsel_output_inv__MASK  0x40
#define VCSEL_CFG4__vcsel_output_inv__WIDTH 1
#define VCSEL_CFG4__vcsel_output_inv__SHIFT 6
#define VCSEL_CFG4__vcsel_output_inv__RESET 0
#define VCSEL_CFG4__vcsel_output_inv 64
#define VCSEL_CFG4__vcsel_start_edge__MASK  0x20
#define VCSEL_CFG4__vcsel_start_edge__WIDTH 1
#define VCSEL_CFG4__vcsel_start_edge__SHIFT 5
#define VCSEL_CFG4__vcsel_start_edge__RESET 1
#define VCSEL_CFG4__vcsel_start_edge 32
#define VCSEL_CFG4__vcsel_frame_len__MASK  0x1f
#define VCSEL_CFG4__vcsel_frame_len__WIDTH 5
#define VCSEL_CFG4__vcsel_frame_len__SHIFT 0
#define VCSEL_CFG4__vcsel_frame_len__RESET 3

#define P2RAM_CONTROL 0xef
#define P2RAM_CONTROL__p2ram_analog__MASK  0x80
#define P2RAM_CONTROL__p2ram_analog__WIDTH 1
#define P2RAM_CONTROL__p2ram_analog__SHIFT 7
#define P2RAM_CONTROL__p2ram_analog__RESET 0
#define P2RAM_CONTROL__p2ram_analog 128
#define P2RAM_CONTROL__p2ram_gload__MASK  0x40
#define P2RAM_CONTROL__p2ram_gload__WIDTH 1
#define P2RAM_CONTROL__p2ram_gload__SHIFT 6
#define P2RAM_CONTROL__p2ram_gload__RESET 0
#define P2RAM_CONTROL__p2ram_gload 64
#define P2RAM_CONTROL__p2ram_burn__MASK  0x8
#define P2RAM_CONTROL__p2ram_burn__WIDTH 1
#define P2RAM_CONTROL__p2ram_burn__SHIFT 3
#define P2RAM_CONTROL__p2ram_burn__RESET 0
#define P2RAM_CONTROL__p2ram_burn 8
#define P2RAM_CONTROL__p2ram_load__MASK  0x4
#define P2RAM_CONTROL__p2ram_load__WIDTH 1
#define P2RAM_CONTROL__p2ram_load__SHIFT 2
#define P2RAM_CONTROL__p2ram_load__RESET 0
#define P2RAM_CONTROL__p2ram_load 4
#define P2RAM_CONTROL__p2ram_state__MASK  0x3
#define P2RAM_CONTROL__p2ram_state__WIDTH 2
#define P2RAM_CONTROL__p2ram_state__SHIFT 0
#define P2RAM_CONTROL__p2ram_state__RESET 0
// Enumeration for p2ram_state
#define P2RAM_CONTROL__p2ram_state__idle 0 // IDLE    
#define P2RAM_CONTROL__p2ram_state__foundry 2 // FOUNDRY 
#define P2RAM_CONTROL__p2ram_state__locked 3 // LOCKED  


#define RESETREASON 0xf0
#define RESETREASON__soft_reset__MASK  0x80
#define RESETREASON__soft_reset__WIDTH 1
#define RESETREASON__soft_reset__SHIFT 7
#define RESETREASON__soft_reset__RESET 0
#define RESETREASON__soft_reset 128
#define RESETREASON__rrsn_power_on_timer__MASK  0x20
#define RESETREASON__rrsn_power_on_timer__WIDTH 1
#define RESETREASON__rrsn_power_on_timer__SHIFT 5
#define RESETREASON__rrsn_power_on_timer__RESET 0
#define RESETREASON__rrsn_power_on_timer 32
#define RESETREASON__rrsn_power_on_i2c__MASK  0x10
#define RESETREASON__rrsn_power_on_i2c__WIDTH 1
#define RESETREASON__rrsn_power_on_i2c__SHIFT 4
#define RESETREASON__rrsn_power_on_i2c__RESET 0
#define RESETREASON__rrsn_power_on_i2c 16
#define RESETREASON__rrsn_watchdog__MASK  0x8
#define RESETREASON__rrsn_watchdog__WIDTH 1
#define RESETREASON__rrsn_watchdog__SHIFT 3
#define RESETREASON__rrsn_watchdog__RESET 0
#define RESETREASON__rrsn_watchdog 8
#define RESETREASON__rrsn_cpu_reset__MASK  0x4
#define RESETREASON__rrsn_cpu_reset__WIDTH 1
#define RESETREASON__rrsn_cpu_reset__SHIFT 2
#define RESETREASON__rrsn_cpu_reset__RESET 0
#define RESETREASON__rrsn_cpu_reset 4
#define RESETREASON__rrsn_soft_reset__MASK  0x2
#define RESETREASON__rrsn_soft_reset__WIDTH 1
#define RESETREASON__rrsn_soft_reset__SHIFT 1
#define RESETREASON__rrsn_soft_reset__RESET 0
#define RESETREASON__rrsn_soft_reset 2
#define RESETREASON__rrsn_coldstart__MASK  0x1
#define RESETREASON__rrsn_coldstart__WIDTH 1
#define RESETREASON__rrsn_coldstart__SHIFT 0
#define RESETREASON__rrsn_coldstart__RESET 0
#define RESETREASON__rrsn_coldstart 1

#define PINMUX0 0xf1
#define PINMUX0__sclfunc__MASK  0xf0
#define PINMUX0__sclfunc__WIDTH 4
#define PINMUX0__sclfunc__SHIFT 4
#define PINMUX0__sclfunc__RESET 0
// Enumeration for sclfunc
#define PINMUX0__sclfunc__scl 0 // SCL
#define PINMUX0__sclfunc__gpio2 1 // GPIO2
#define PINMUX0__sclfunc__swc 2 // SWC
#define PINMUX0__sclfunc__testmux0 8 // Testmux0
#define PINMUX0__sclfunc__testmux1 9 // Testmux1
#define PINMUX0__sclfunc__testmux2 10 // Testmux2
#define PINMUX0__sclfunc__testmux3 11 // Testmux3
#define PINMUX0__sclfunc__testmux4 12 // Testmux4
#define PINMUX0__sclfunc__testmux5 13 // Testmux5
#define PINMUX0__sclfunc__testmux6 14 // Testmux6
#define PINMUX0__sclfunc__testmux7 15 // Testmux7

#define PINMUX0__sdafunc__MASK  0xf
#define PINMUX0__sdafunc__WIDTH 4
#define PINMUX0__sdafunc__SHIFT 0
#define PINMUX0__sdafunc__RESET 0
// Enumeration for sdafunc
#define PINMUX0__sdafunc__sda 0 // SDA
#define PINMUX0__sdafunc__gpio3 1 // GPIO3
#define PINMUX0__sdafunc__swd 2 // SWD
#define PINMUX0__sdafunc__testmux0 8 // Testmux0
#define PINMUX0__sdafunc__testmux1 9 // Testmux1
#define PINMUX0__sdafunc__testmux2 10 // Testmux2
#define PINMUX0__sdafunc__testmux3 11 // Testmux3
#define PINMUX0__sdafunc__testmux4 12 // Testmux4
#define PINMUX0__sdafunc__testmux5 13 // Testmux5
#define PINMUX0__sdafunc__testmux6 14 // Testmux6
#define PINMUX0__sdafunc__testmux7 15 // Testmux7


#define PINMUX1 0xf2
#define PINMUX1__intfunc__MASK  0xf0
#define PINMUX1__intfunc__WIDTH 4
#define PINMUX1__intfunc__SHIFT 4
#define PINMUX1__intfunc__RESET 0
// Enumeration for intfunc
#define PINMUX1__intfunc__int 0 // INT
#define PINMUX1__intfunc__gpio4 1 // GPIO4
#define PINMUX1__intfunc__swc 2 // SWC
#define PINMUX1__intfunc__uart 3 // UART
#define PINMUX1__intfunc__testmux0 8 // Testmux0
#define PINMUX1__intfunc__testmux1 9 // Testmux1
#define PINMUX1__intfunc__testmux2 10 // Testmux2
#define PINMUX1__intfunc__testmux3 11 // Testmux3
#define PINMUX1__intfunc__testmux4 12 // Testmux4
#define PINMUX1__intfunc__testmux5 13 // Testmux5
#define PINMUX1__intfunc__testmux6 14 // Testmux6
#define PINMUX1__intfunc__testmux7 15 // Testmux7

#define PINMUX1__gpio0func__MASK  0xf
#define PINMUX1__gpio0func__WIDTH 4
#define PINMUX1__gpio0func__SHIFT 0
#define PINMUX1__gpio0func__RESET 0
// Enumeration for gpio0func
#define PINMUX1__gpio0func__gpio0 0 // GPIO0
#define PINMUX1__gpio0func__swd 1 // SWD
#define PINMUX1__gpio0func__vcsel_clk 2 // VCSEL_CLK
#define PINMUX1__gpio0func__uart 3 // UART
#define PINMUX1__gpio0func__sync_out 4 // SYNC_OUT
#define PINMUX1__gpio0func__testmux0 8 // Testmux0
#define PINMUX1__gpio0func__testmux1 9 // Testmux1
#define PINMUX1__gpio0func__testmux2 10 // Testmux2
#define PINMUX1__gpio0func__testmux3 11 // Testmux3
#define PINMUX1__gpio0func__testmux4 12 // Testmux4
#define PINMUX1__gpio0func__testmux5 13 // Testmux5
#define PINMUX1__gpio0func__testmux6 14 // Testmux6
#define PINMUX1__gpio0func__testmux7 15 // Testmux7


#define PINMUX2 0xf3
#define PINMUX2__gpio1func__MASK  0xf0
#define PINMUX2__gpio1func__WIDTH 4
#define PINMUX2__gpio1func__SHIFT 4
#define PINMUX2__gpio1func__RESET 0
// Enumeration for gpio1func
#define PINMUX2__gpio1func__gpio1 0 // GPIO1
#define PINMUX2__gpio1func__swc 1 // SWC
#define PINMUX2__gpio1func__reserved 2 // reserved2
#define PINMUX2__gpio1func__uart 3 // UART
#define PINMUX2__gpio1func__sync_out 4 // SYNC_OUT
#define PINMUX2__gpio1func__testmux0 8 // Testmux0
#define PINMUX2__gpio1func__testmux1 9 // Testmux1
#define PINMUX2__gpio1func__testmux2 10 // Testmux2
#define PINMUX2__gpio1func__testmux3 11 // Testmux3
#define PINMUX2__gpio1func__testmux4 12 // Testmux4
#define PINMUX2__gpio1func__testmux5 13 // Testmux5
#define PINMUX2__gpio1func__testmux6 14 // Testmux6
#define PINMUX2__gpio1func__testmux7 15 // Testmux7


#define EXTCLK 0xf4
#define EXTCLK__en_vcdrv_ext_clk_input__MASK  0x8
#define EXTCLK__en_vcdrv_ext_clk_input__WIDTH 1
#define EXTCLK__en_vcdrv_ext_clk_input__SHIFT 3
#define EXTCLK__en_vcdrv_ext_clk_input__RESET 0
#define EXTCLK__en_vcdrv_ext_clk_input 8
#define EXTCLK__en_vcdrv_ext_clk_output__MASK  0x4
#define EXTCLK__en_vcdrv_ext_clk_output__WIDTH 1
#define EXTCLK__en_vcdrv_ext_clk_output__SHIFT 2
#define EXTCLK__en_vcdrv_ext_clk_output__RESET 0
#define EXTCLK__en_vcdrv_ext_clk_output 4
#define EXTCLK__extclk_pin__MASK  0x2
#define EXTCLK__extclk_pin__WIDTH 1
#define EXTCLK__extclk_pin__SHIFT 1
#define EXTCLK__extclk_pin__RESET 0
#define EXTCLK__extclk_pin 2
// Enumeration for extclk_pin
#define EXTCLK__extclk_pin__gpio0 0 // GPIO0
#define EXTCLK__extclk_pin__int 1 // INT

#define EXTCLK__extclk_mode__MASK  0x1
#define EXTCLK__extclk_mode__WIDTH 1
#define EXTCLK__extclk_mode__SHIFT 0
#define EXTCLK__extclk_mode__RESET 0
#define EXTCLK__extclk_mode 1

#define GPIO_DRVSTR 0xf5
#define GPIO_DRVSTR__en_temp_sensor__MASK  0xc0
#define GPIO_DRVSTR__en_temp_sensor__WIDTH 2
#define GPIO_DRVSTR__en_temp_sensor__SHIFT 6
#define GPIO_DRVSTR__en_temp_sensor__RESET 0
#define GPIO_DRVSTR__gpio1_dvrstr__MASK  0xc
#define GPIO_DRVSTR__gpio1_dvrstr__WIDTH 2
#define GPIO_DRVSTR__gpio1_dvrstr__SHIFT 2
#define GPIO_DRVSTR__gpio1_dvrstr__RESET 0
#define GPIO_DRVSTR__gpio0_dvrstr__MASK  0x3
#define GPIO_DRVSTR__gpio0_dvrstr__WIDTH 2
#define GPIO_DRVSTR__gpio0_dvrstr__SHIFT 0
#define GPIO_DRVSTR__gpio0_dvrstr__RESET 0

#define BVTCCFG 0xf6
#define BVTCCFG__bvtc_rquench__MASK  0x38
#define BVTCCFG__bvtc_rquench__WIDTH 3
#define BVTCCFG__bvtc_rquench__SHIFT 3
#define BVTCCFG__bvtc_rquench__RESET 0
#define BVTCCFG__bvtc_vex__MASK  0x7
#define BVTCCFG__bvtc_vex__WIDTH 3
#define BVTCCFG__bvtc_vex__SHIFT 0
#define BVTCCFG__bvtc_vex__RESET 0

