Zalmotek/renesas-RA8M1-feather/RA8M1-Tutorials/1-inputs/RA8M1_Feather_Inputs_PMODScreenDemo/src/registers_i2c.h
#define BVTC1 0xf7
#define BVTC1__bvtc1_comp_vth__MASK  0x40
#define BVTC1__bvtc1_comp_vth__WIDTH 1
#define BVTC1__bvtc1_comp_vth__SHIFT 6
#define BVTC1__bvtc1_comp_vth__RESET 0
#define BVTC1__bvtc1_comp_vth 64
#define BVTC1__bvtc1_comp_vtl__MASK  0x20
#define BVTC1__bvtc1_comp_vtl__WIDTH 1
#define BVTC1__bvtc1_comp_vtl__SHIFT 5
#define BVTC1__bvtc1_comp_vtl__RESET 0
#define BVTC1__bvtc1_comp_vtl 32
#define BVTC1__lock_bvtc1_comp__MASK  0x10
#define BVTC1__lock_bvtc1_comp__WIDTH 1
#define BVTC1__lock_bvtc1_comp__SHIFT 4
#define BVTC1__lock_bvtc1_comp__RESET 0
#define BVTC1__lock_bvtc1_comp 16
#define BVTC1__reset_bvtc1_comp__MASK  0x8
#define BVTC1__reset_bvtc1_comp__WIDTH 1
#define BVTC1__reset_bvtc1_comp__SHIFT 3
#define BVTC1__reset_bvtc1_comp__RESET 0
#define BVTC1__reset_bvtc1_comp 8
#define BVTC1__en_bvtc1_comp_vth__MASK  0x4
#define BVTC1__en_bvtc1_comp_vth__WIDTH 1
#define BVTC1__en_bvtc1_comp_vth__SHIFT 2
#define BVTC1__en_bvtc1_comp_vth__RESET 0
#define BVTC1__en_bvtc1_comp_vth 4
#define BVTC1__en_bvtc1_comp_vtl__MASK  0x2
#define BVTC1__en_bvtc1_comp_vtl__WIDTH 1
#define BVTC1__en_bvtc1_comp_vtl__SHIFT 1
#define BVTC1__en_bvtc1_comp_vtl__RESET 0
#define BVTC1__en_bvtc1_comp_vtl 2
#define BVTC1__en_bvdetect1__MASK  0x1
#define BVTC1__en_bvdetect1__WIDTH 1
#define BVTC1__en_bvdetect1__SHIFT 0
#define BVTC1__en_bvdetect1__RESET 0
#define BVTC1__en_bvdetect1 1

#define BVTC2 0xf8
#define BVTC2__bvtc2_comp_vth__MASK  0x40
#define BVTC2__bvtc2_comp_vth__WIDTH 1
#define BVTC2__bvtc2_comp_vth__SHIFT 6
#define BVTC2__bvtc2_comp_vth__RESET 0
#define BVTC2__bvtc2_comp_vth 64
#define BVTC2__bvtc2_comp_vtl__MASK  0x20
#define BVTC2__bvtc2_comp_vtl__WIDTH 1
#define BVTC2__bvtc2_comp_vtl__SHIFT 5
#define BVTC2__bvtc2_comp_vtl__RESET 0
#define BVTC2__bvtc2_comp_vtl 32
#define BVTC2__lock_bvtc2_comp__MASK  0x10
#define BVTC2__lock_bvtc2_comp__WIDTH 1
#define BVTC2__lock_bvtc2_comp__SHIFT 4
#define BVTC2__lock_bvtc2_comp__RESET 0
#define BVTC2__lock_bvtc2_comp 16
#define BVTC2__reset_bvtc2_comp__MASK  0x8
#define BVTC2__reset_bvtc2_comp__WIDTH 1
#define BVTC2__reset_bvtc2_comp__SHIFT 3
#define BVTC2__reset_bvtc2_comp__RESET 0
#define BVTC2__reset_bvtc2_comp 8
#define BVTC2__en_bvtc2_comp_vth__MASK  0x4
#define BVTC2__en_bvtc2_comp_vth__WIDTH 1
#define BVTC2__en_bvtc2_comp_vth__SHIFT 2
#define BVTC2__en_bvtc2_comp_vth__RESET 0
#define BVTC2__en_bvtc2_comp_vth 4
#define BVTC2__en_bvtc2_comp_vtl__MASK  0x2
#define BVTC2__en_bvtc2_comp_vtl__WIDTH 1
#define BVTC2__en_bvtc2_comp_vtl__SHIFT 1
#define BVTC2__en_bvtc2_comp_vtl__RESET 0
#define BVTC2__en_bvtc2_comp_vtl 2
#define BVTC2__en_bvdetect2__MASK  0x1
#define BVTC2__en_bvdetect2__WIDTH 1
#define BVTC2__en_bvdetect2__SHIFT 0
#define BVTC2__en_bvdetect2__RESET 0
#define BVTC2__en_bvdetect2 1

#define VCSEL_CFG5 0xf9
#define VCSEL_CFG5__vcsel_start__MASK  0xf0
#define VCSEL_CFG5__vcsel_start__WIDTH 4
#define VCSEL_CFG5__vcsel_start__SHIFT 4
#define VCSEL_CFG5__vcsel_start__RESET 0
#define VCSEL_CFG5__vcsel_length__MASK  0xf
#define VCSEL_CFG5__vcsel_length__WIDTH 4
#define VCSEL_CFG5__vcsel_length__SHIFT 0
#define VCSEL_CFG5__vcsel_length__RESET 0

#define DBGTMUX01 0xfa
#define DBGTMUX01__dbg1mux__MASK  0x70
#define DBGTMUX01__dbg1mux__WIDTH 3
#define DBGTMUX01__dbg1mux__SHIFT 4
#define DBGTMUX01__dbg1mux__RESET 0
// Enumeration for dbg1mux
#define DBGTMUX01__dbg1mux__vcdrv_check_eyesafe 0 // VCDRV_CHECK_EYESAFE_1V2_D  
#define DBGTMUX01__dbg1mux__pll_fdivt 1 // PLL_FDIVT_1V2_D            
#define DBGTMUX01__dbg1mux__i2c_p2ram 2 // i2c.p2ram                         
#define DBGTMUX01__dbg1mux__n_reset_adc 3 // N_RESET_ADC_1V2_D          
#define DBGTMUX01__dbg1mux__bvtc2_comp_vth 4 // BVTC2_COMP_VTH_1V2_D       
#define DBGTMUX01__dbg1mux__i2c_bank 5 // i2c_bank                     
#define DBGTMUX01__dbg1mux__uvcomp_tm1 6 // UVCOMP_TM_1V2_D[1]         
#define DBGTMUX01__dbg1mux__sda_test_del_rise 7 // SDA_TEST_DEL_RISE_1V2_D    

#define DBGTMUX01__dbg0mux__MASK  0x7
#define DBGTMUX01__dbg0mux__WIDTH 3
#define DBGTMUX01__dbg0mux__SHIFT 0
#define DBGTMUX01__dbg0mux__RESET 0
// Enumeration for dbg0mux
#define DBGTMUX01__dbg0mux__chp_overload 0 // CHP_OVERLOAD_1V2_D         
#define DBGTMUX01__dbg0mux__clk_40m 1 // CLK_40M_1V2_D              
#define DBGTMUX01__dbg0mux__i2c_p2ram 2 // i2c.p2ram                         
#define DBGTMUX01__dbg0mux__set_adc_track_extend 3 // SET_ADC_TRACK_EXTEND_1V2_D 
#define DBGTMUX01__dbg0mux__bvtc2_comp_vtl 4 // BVTC2_COMP_VTL_1V2_D       
#define DBGTMUX01__dbg0mux__i2c_bank_request 5 // i2c_bank_request             
#define DBGTMUX01__dbg0mux__uvcomp_tm2 6 // UVCOMP_TM_1V2_D[2]         
#define DBGTMUX01__dbg0mux__sda_test_del_fall 7 // SDA_TEST_DEL_FALL_1V2_D    


#define DBGTMUX23 0xfb
#define DBGTMUX23__dbg3mux__MASK  0x70
#define DBGTMUX23__dbg3mux__WIDTH 3
#define DBGTMUX23__dbg3mux__SHIFT 4
#define DBGTMUX23__dbg3mux__RESET 0
// Enumeration for dbg3mux
#define DBGTMUX23__dbg3mux__leda_fail 0 // LEDA_FAIL_1V2_D            
#define DBGTMUX23__dbg3mux__en_osc 1 // EN_OSC_1V2_D               
#define DBGTMUX23__dbg3mux__gpio0_pad2dig 2 // GPIO0_PAD2DIG_1V2_D        
#define DBGTMUX23__dbg3mux__adc_sdata 3 // ADC_SDATA_1V2_D            
#define DBGTMUX23__dbg3mux__bvtc1_comp_vth 4 // BVTC1_COMP_VTH_1V2_D       
#define DBGTMUX23__dbg3mux__sys_lockup 5 // sys_lockup                   
#define DBGTMUX23__dbg3mux__en_vcseldrv 6 // EN_VCSELDRV_1V2_D          
#define DBGTMUX23__dbg3mux__scl_test_del_rise 7 // SCL_TEST_DEL_RISE_1V2_D    

#define DBGTMUX23__dbg2mux__MASK  0x7
#define DBGTMUX23__dbg2mux__WIDTH 3
#define DBGTMUX23__dbg2mux__SHIFT 0
#define DBGTMUX23__dbg2mux__RESET 0
// Enumeration for dbg2mux
#define DBGTMUX23__dbg2mux__ledk_fail 0 // LEDK_FAIL_1V2_D            
#define DBGTMUX23__dbg2mux__osc_okay 1 // OSC_OKAY_1V2_D             
#define DBGTMUX23__dbg2mux__gpio0_anaen 2 // GPIO0_ANAEN_1V2_D          
#define DBGTMUX23__dbg2mux__adc_start_con 3 // ADC_START_CON_1V2_D        
#define DBGTMUX23__dbg2mux__bvtc1_comp_vtl 4 // BVTC1_COMP_VTL_1V2_D       
#define DBGTMUX23__dbg2mux__sys_halted 5 // sys_halted                   
#define DBGTMUX23__dbg2mux__en_chp 6 // EN_CHP_1V2_D               
#define DBGTMUX23__dbg2mux__scl_test_del_fall 7 // SCL_TEST_DEL_FALL_1V2_d    


#define DBGTMUX45 0xfc
#define DBGTMUX45__dbg5mux__MASK  0x70
#define DBGTMUX45__dbg5mux__WIDTH 3
#define DBGTMUX45__dbg5mux__SHIFT 4
#define DBGTMUX45__dbg5mux__RESET 0
// Enumeration for dbg5mux
#define DBGTMUX45__dbg5mux__vpulse_vcsel 0 // VPULSE_VCSEL_1V2_D         
#define DBGTMUX45__dbg5mux__clk_160m 1 // CLK_160M_1V2_D             
#define DBGTMUX45__dbg5mux__sda_pad2dig3 2 // SDA_PAD2DIG3_1V2_D         
#define DBGTMUX45__dbg5mux__adc_data4 3 // ADC_DATA_1V2_D[4]          
#define DBGTMUX45__dbg5mux__reset_bvtc1_comp 4 // RESET_BVTC1_COMP_1V2_D     
#define DBGTMUX45__dbg5mux__uvcomp_tm0 5 // UVCOMP_TM_1V2_D[0]         
#define DBGTMUX45__dbg5mux__en_pll 6 // EN_PLL_1V2_D               
#define DBGTMUX45__dbg5mux__scl_pad2dig1 7 // SCL_PAD2DIG1_1V2_D         

#define DBGTMUX45__dbg4mux__MASK  0x7
#define DBGTMUX45__dbg4mux__WIDTH 3
#define DBGTMUX45__dbg4mux__SHIFT 0
#define DBGTMUX45__dbg4mux__RESET 0
// Enumeration for dbg4mux
#define DBGTMUX45__dbg4mux__psw_on 0 // PSW_ON_1V2_D               
#define DBGTMUX45__dbg4mux__pll_locked 1 // PLL_LOCKED_1V2_D           
#define DBGTMUX45__dbg4mux__gpio1_pad2dig 2 // GPIO1_PAD2DIG_1V2_D        
#define DBGTMUX45__dbg4mux__adc_eoc 3 // ADC_EOC_1V2_D              
#define DBGTMUX45__dbg4mux__reset_bvtc2_comp 4 // RESET_BVTC2_COMP_1V2_D     
#define DBGTMUX45__dbg4mux__sys_sleeping 5 // sys_sleeping                 
#define DBGTMUX45__dbg4mux__en_ldo_tdc 6 // EN_LDO_TDC_1V2_D           
#define DBGTMUX45__dbg4mux__scl_pad2dig3 7 // SCL_PAD2DIG3_1V2_D         


#define DBGTMUX67 0xfd
#define DBGTMUX67__dbg7mux__MASK  0x70
#define DBGTMUX67__dbg7mux__WIDTH 3
#define DBGTMUX67__dbg7mux__SHIFT 4
#define DBGTMUX67__dbg7mux__RESET 0
// Enumeration for dbg7mux
#define DBGTMUX67__dbg7mux__vdd3v3_dig_ready 0 // VDD3V3_DIG_READY_1V2_D      
#define DBGTMUX67__dbg7mux__clk_5m 1 // CLK_5M_1V2_D               
#define DBGTMUX67__dbg7mux__sda_pad2dig0 2 // SDA_PAD2DIG0_1V2_D         
#define DBGTMUX67__dbg7mux__clk_adc_1m25 3 // CLK_ADC_1M25_1V2_D         
#define DBGTMUX67__dbg7mux__en_bvtc1 4 // EN_BVTC1_1V2_D             
#define DBGTMUX67__dbg7mux__por_tm 5 // POR_TM_1V2_D               
#define DBGTMUX67__dbg7mux__i2c_pon 6 // i2c.pon                           
#define DBGTMUX67__dbg7mux__scl_pad2dig0 7 // SCL_PAD2DIG0_1V2_D         

#define DBGTMUX67__dbg6mux__MASK  0x7
#define DBGTMUX67__dbg6mux__WIDTH 3
#define DBGTMUX67__dbg6mux__SHIFT 0
#define DBGTMUX67__dbg6mux__RESET 0
// Enumeration for dbg6mux
#define DBGTMUX67__dbg6mux__clamp_active 0 // CLAMP_ACTIVE_1V2_D         
#define DBGTMUX67__dbg6mux__clk_vcdrv_160m 1 // CLK_VCDRV_160M_1V2_D       
#define DBGTMUX67__dbg6mux__sda_pad2dig1 2 // SDA_PAD2DIG1_1V2_D         
#define DBGTMUX67__dbg6mux__adc_converting 3 // ADC_CONVERTING_1V2_D       
#define DBGTMUX67__dbg6mux__en_bvtc2 4 // EN_BVTC2_1V2_D             
#define DBGTMUX67__dbg6mux__vcdrv_tmx_dig 5 // VCDRV_TMX_DIG_1V2_D        
#define DBGTMUX67__dbg6mux__i2c_cpu_ready 6 // i2c.cpu_ready                     
#define DBGTMUX67__dbg6mux__scl_pad2dig0 7 // SCL_PAD2DIG0_1V2_D         


#define PASSWORD 0xfe
#define PASSWORD__atpg_mode__MASK  0x80
#define PASSWORD__atpg_mode__WIDTH 1
#define PASSWORD__atpg_mode__SHIFT 7
#define PASSWORD__atpg_mode__RESET 0
#define PASSWORD__atpg_mode 128
#define PASSWORD__chainlen_write_hi__MASK  0x40
#define PASSWORD__chainlen_write_hi__WIDTH 1
#define PASSWORD__chainlen_write_hi__SHIFT 6
#define PASSWORD__chainlen_write_hi__RESET 0
#define PASSWORD__chainlen_write_hi 64
#define PASSWORD__chainlen_write_lo__MASK  0x20
#define PASSWORD__chainlen_write_lo__WIDTH 1
#define PASSWORD__chainlen_write_lo__SHIFT 5
#define PASSWORD__chainlen_write_lo__RESET 0
#define PASSWORD__chainlen_write_lo 32
#define PASSWORD__rg_password2__MASK  0x2
#define PASSWORD__rg_password2__WIDTH 1
#define PASSWORD__rg_password2__SHIFT 1
#define PASSWORD__rg_password2__RESET 0
#define PASSWORD__rg_password2 2
#define PASSWORD__password__MASK  0x1
#define PASSWORD__password__WIDTH 1
#define PASSWORD__password__SHIFT 0
#define PASSWORD__password__RESET 0
#define PASSWORD__password 1

#define CTRLOCC 0xff
#define CTRLOCC__chain_sel__MASK  0xe0
#define CTRLOCC__chain_sel__WIDTH 3
#define CTRLOCC__chain_sel__SHIFT 5
#define CTRLOCC__chain_sel__RESET 0
#define CTRLOCC__pll_bypass__MASK  0x10
#define CTRLOCC__pll_bypass__WIDTH 1
#define CTRLOCC__pll_bypass__SHIFT 4
#define CTRLOCC__pll_bypass__RESET 0
#define CTRLOCC__pll_bypass 16
#define CTRLOCC__refclk_div2__MASK  0x8
#define CTRLOCC__refclk_div2__WIDTH 1
#define CTRLOCC__refclk_div2__SHIFT 3
#define CTRLOCC__refclk_div2__RESET 0
#define CTRLOCC__refclk_div2 8
#define CTRLOCC__ate_is_refclk__MASK  0x4
#define CTRLOCC__ate_is_refclk__WIDTH 1
#define CTRLOCC__ate_is_refclk__SHIFT 2
#define CTRLOCC__ate_is_refclk__RESET 0
#define CTRLOCC__ate_is_refclk 4

#endif // REGISTERS_I2C_H
